10/data/attachments/104a6736b0c296d0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e466355c-ac6c-4c71-a4ff-8aeb04df75bd</nif:username>
            <nif:friendToBeAdded>Stephanie_imagine_Actions_1334_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>